CREATE DATABASE  IF NOT EXISTS `upload_test` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `upload_test`;
-- MySQL dump 10.13  Distrib 8.0.13, for Win64 (x86_64)
--
-- Host: localhost    Database: upload_test
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `mysubject`
--

DROP TABLE IF EXISTS `mysubject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `mysubject` (
  `userId` varchar(45) NOT NULL,
  `takeYear` varchar(45) NOT NULL,
  `takeSemester` varchar(45) NOT NULL,
  `subjectCode` varchar(45) NOT NULL,
  `subjectName` varchar(45) NOT NULL,
  `credit` varchar(45) NOT NULL,
  `score` varchar(45) NOT NULL,
  `changeComplete` varchar(45) DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `completionDivision` varchar(45) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=335 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mysubject`
--

LOCK TABLES `mysubject` WRITE;
/*!40000 ALTER TABLE `mysubject` DISABLE KEYS */;
INSERT INTO `mysubject` VALUES ('201632004','2016','1학기','AC00001','경배와 찬양','0','P',NULL,75,'교필'),('201632004','2016','1학기','AC00012','대학생활세미나 I','2','P',NULL,76,'교필'),('201632004','2016','1학기','AD00016','영어명문산책 I','3','B0',NULL,77,'교선'),('201632004','2016','1학기','AF00031','애니메이션과게임으로세상읽기','3','C+',NULL,78,'교선'),('201632004','2016','1학기','ID00001','C프로그래밍Ⅰ','3','B0',NULL,79,'전필'),('201632004','2016','1학기','ID00004','정보통신개론','3','B0',NULL,80,'전선'),('201632004','2016','2학기','AC00001','시네마채플','0','P',NULL,81,'교필'),('201632004','2016','2학기','AC00013','말과글','2','B+',NULL,82,'교필'),('201632004','2016','2학기','AC00014','대학생활세미나 II','1','P',NULL,83,'교필'),('201632004','2016','2학기','AF00015','과학과 종교','3','B0',NULL,84,'교선'),('201632004','2016','2학기','AF00023','공업수학','3','C0',NULL,85,'교선'),('201632004','2016','2학기','GG00045','공연기획 및 제작','3','D+',NULL,86,'교선'),('201632004','2016','2학기','ID00023','C프로그래밍Ⅱ','3','A0',NULL,87,'전필'),('201632004','2016','2학기','ID00006','웹페이지 구축','3','B0',NULL,88,'전선'),('201632004','2016','2학기','ID00027','컴퓨터구조','3','B+',NULL,89,'전선'),('201632004','2017','1학기','AC00001','경배와 찬양','0','P',NULL,90,'교필'),('201632004','2017','1학기','AC00004','기초영어I','3','C+',NULL,91,'교선'),('201632004','2017','1학기','AC00007','인권과평화','3','P',NULL,92,'교선'),('201632004','2017','1학기','AD00029','연극과 공연예술','3','C+',NULL,93,'교선'),('201632004','2017','1학기','AF00024','확률','3','A0',NULL,94,'교선'),('201632004','2017','1학기','ID00005','논리회로설계 [R]','3','B+',NULL,95,'전필'),('201632004','2017','1학기','ID00007','전공지도I','1','P',NULL,96,'전필'),('201632004','2017','1학기','ID00008','자료구조','3','B0',NULL,97,'전필'),('201632004','2017','2학기','AC00001','경배와 찬양','0','P',NULL,98,'교필'),('201632004','2017','2학기','ID00029','데이터통신','3','C0',NULL,99,'전필'),('201632004','2017','2학기','ID00030','전공지도II','1','P',NULL,100,'전필'),('201632004','2017','2학기','ID00031','객체지향시스템','3','A+',NULL,101,'전필'),('201632004','2017','2학기','ID00028','통신이론','3','B+',NULL,102,'전선'),('201632004','2017','2학기','ID00032','리눅스 시스템','3','B0',NULL,103,'전선'),('201632004','2017','2학기','HB00019','문화컨텐츠 입문','3','B+',NULL,104,'복필'),('201632004','2018','1학기','AC00003','사회봉사I','2','P',NULL,105,'교필'),('201632004','2018','1학기','ID00009','운영체제','3','D0',NULL,106,'전필'),('201632004','2018','1학기','HB00002','디지털기초디자인','3','B+',NULL,107,'복필'),('201632004','2018','1학기','HB00018','문화컨텐츠 유통과 마케팅','3','B0',NULL,108,'복필'),('201632004','2018','1학기','HB00029','3D모델링','3','A0',NULL,109,'복필'),('201632004','2018','1학기','HB00046','스토리보드 제작','3','C+',NULL,110,'복선'),('201632004','2018','1학기','HB00085','3D기초&3D프린터 활용','1','P',NULL,111,'복선'),('201632005','2016','1학기','AC00001','경배와 찬양','0','P',NULL,112,'교필'),('201632005','2016','1학기','AC00012','대학생활세미나 I','2','P',NULL,113,'교필'),('201632005','2016','1학기','AD00016','영어명문산책 I','3','B0',NULL,114,'교선'),('201632005','2016','1학기','AF00031','애니메이션과게임으로세상읽기','3','C+',NULL,115,'교선'),('201632005','2016','1학기','ID00001','C프로그래밍Ⅰ','3','B0',NULL,116,'전필'),('201632005','2016','1학기','ID00004','정보통신개론','3','B0',NULL,117,'전선'),('201632005','2016','2학기','AC00001','시네마채플','0','P',NULL,118,'교필'),('201632005','2016','2학기','AC00013','말과글','2','B+',NULL,119,'교필'),('201632005','2016','2학기','AC00014','대학생활세미나 II','1','P',NULL,120,'교필'),('201632005','2016','2학기','AF00015','과학과 종교','3','B0',NULL,121,'교선'),('201632005','2016','2학기','AF00023','공업수학','3','C0',NULL,122,'교선'),('201632005','2016','2학기','GG00045','공연기획 및 제작','3','D+',NULL,123,'교선'),('201632005','2016','2학기','ID00023','C프로그래밍Ⅱ','3','A0',NULL,124,'전필'),('201632005','2016','2학기','ID00006','웹페이지 구축','3','B0',NULL,125,'전선'),('201632005','2016','2학기','ID00027','컴퓨터구조','3','B+',NULL,126,'전선'),('201632005','2017','1학기','AC00001','경배와 찬양','0','P',NULL,127,'교필'),('201632005','2017','1학기','AC00004','기초영어I','3','C+',NULL,128,'교선'),('201632005','2017','1학기','AC00007','인권과평화','3','P',NULL,129,'교선'),('201632005','2017','1학기','AD00029','연극과 공연예술','3','C+',NULL,130,'교선'),('201632005','2017','1학기','AF00024','확률','3','A0',NULL,131,'교선'),('201632005','2017','1학기','ID00005','논리회로설계 [R]','3','B+',NULL,132,'전필'),('201632005','2017','1학기','ID00007','전공지도I','1','P',NULL,133,'전필'),('201632005','2017','1학기','ID00008','자료구조','3','B0',NULL,134,'전필'),('201632005','2017','2학기','AC00001','경배와 찬양','0','P',NULL,135,'교필'),('201632005','2017','2학기','ID00029','데이터통신','3','C0',NULL,136,'전필'),('201632005','2017','2학기','ID00030','전공지도II','1','P',NULL,137,'전필'),('201632005','2017','2학기','ID00031','객체지향시스템','3','A+',NULL,138,'전필'),('201632005','2017','2학기','ID00028','통신이론','3','B+',NULL,139,'전선'),('201632005','2017','2학기','ID00032','리눅스 시스템','3','B0',NULL,140,'전선'),('201632005','2017','2학기','HB00019','문화컨텐츠 입문','3','B+',NULL,141,'복필'),('201632005','2018','1학기','AC00003','사회봉사I','2','P',NULL,142,'교필'),('201632005','2018','1학기','ID00009','운영체제','3','D0',NULL,143,'전필'),('201632005','2018','1학기','HB00002','디지털기초디자인','3','B+',NULL,144,'복필'),('201632005','2018','1학기','HB00018','문화컨텐츠 유통과 마케팅','3','B0',NULL,145,'복필'),('201632005','2018','1학기','HB00029','3D모델링','3','A0',NULL,146,'복필'),('201632005','2018','1학기','HB00046','스토리보드 제작','3','C+',NULL,147,'복선'),('200831041','2013','1학기','AC00001','채플(감사성찬례1)','0','P',NULL,198,'교필'),('200831041','2013','1학기','AC00011','인문학의 세계-느티아래 강좌','3','P',NULL,199,'교필'),('200831041','2013','1학기','AD00003','교양일본어 1','3','B0',NULL,200,'교선'),('200831041','2013','1학기','AE00016','영상과 문화로 보는 러시아','3','B+',NULL,201,'교선'),('200831041','2013','1학기','AE00022','정보사회론','3','B+',NULL,202,'교선'),('200831041','2013','1학기','AF00011','이산수학','3','A+',NULL,203,'교선'),('200831041','2013','1학기','IC00001','C프로그래밍Ⅰ','3','A+',NULL,204,'전필'),('200831041','2013','1학기','IC00016','과정지도 I','1','P',NULL,205,'전필'),('200831041','2013','2학기','AC00001','채플(종교 간 대화의 영성)','0','P',NULL,206,'교필'),('200831041','2013','2학기','AD00004','교양일본어 2','3','B+',NULL,207,'교선'),('200831041','2013','2학기','AD00039','서양문학의 흐름','3','C0',NULL,208,'교선'),('200831041','2013','2학기','AD00049','한국현대사','3','B+',NULL,209,'교선'),('200831041','2013','2학기','AF00001','컴퓨터활용','3','A+',NULL,210,'교선'),('200831041','2013','2학기','AF00002','대학수학','3','A+',NULL,211,'교선'),('200831041','2013','2학기','IC00019','C프로그래밍Ⅱ','3','A+',NULL,212,'전필'),('200831041','2013','2학기','IC00034','과정지도2','1','P',NULL,213,'전필'),('200831041','2014','1학기','AC00001','채플(시네마채플)','0','P',NULL,214,'교필'),('200831041','2014','1학기','AD00022','역사속의 한국과 미국','3','B+',NULL,215,'교선'),('200831041','2014','1학기','AE00012','아시아사회와 문화','3','D+',NULL,216,'교선'),('200831041','2014','1학기','AE00028','대중음악의이해','3','A+',NULL,217,'교선'),('200831041','2014','1학기','IC00002','컴퓨터구조','3','A+',NULL,218,'전필'),('200831041','2014','1학기','IC00003','데이타베이스개론','3','A+',NULL,219,'전필'),('200831041','2014','1학기','IC00007','자바프로그래밍','3','A0',NULL,220,'전필'),('200831041','2014','1학기','IC00017','과정지도3','1','P',NULL,221,'전필'),('200831041','2016','2학기','AC00001','경배와 찬양','0','P',NULL,222,'교필'),('200831041','2016','2학기','AD00114','인터넷과 글쓰기','3','B+',NULL,223,'교선'),('200831041','2016','2학기','AF00022','IT직업의 세계','3','B+',NULL,224,'교선'),('200831041','2016','2학기','IC00005','운영체제론','3','A0',NULL,225,'전필'),('200831041','2016','2학기','IC00021','자료구조론','3','A+',NULL,226,'전필'),('200831041','2016','2학기','IC00039','과정지도4','1','P',NULL,227,'전필'),('200831041','2016','2학기','IC00028','데이터베이스실습','3','A+',NULL,228,'전선'),('200831041','2016','2학기','IC00058','고급 Java 프로그래밍','3','B+',NULL,229,'전선'),('200831041','2017','1학기','IC00010','알고리즘','3','A+',NULL,230,'전필'),('200831041','2017','1학기','IC00043','과정지도5','1','P',NULL,231,'전필'),('200831041','2017','1학기','IC00006','시스템분석 및 설계','3','A0',NULL,232,'전선'),('200831041','2017','1학기','IC00011','고급웹프로그래밍 I','3','A0',NULL,233,'전선'),('200831041','2017','1학기','IC00029','사물인터넷기초','3','A0',NULL,234,'전선'),('200831041','2017','1학기','IC00036','C++프로그래밍','3','A+',NULL,235,'전선'),('200831041','2017','1학기','IC00060','Python 프로그래밍','3','A+',NULL,236,'전선'),('200831041','2017','2학기','AC00003','사회봉사I','2','P',NULL,237,'교필'),('200831041','2017','2학기','IC00044','과정지도6','1','P',NULL,238,'전필'),('200831041','2017','2학기','IC00018','사물인터넷 캡스톤디자인','6','A+',NULL,239,'전선'),('200831041','2017','2학기','IC00030','데이터베이스 캡스톤디자인','6','A+',NULL,240,'전선'),('200831041','2017','2학기','IC00040','고급웹프로그래밍 II','3','A+',NULL,241,'전선'),('200831041','2017','2학기','IC00045','모바일 프로그래밍 I','3','A+',NULL,242,'전선'),('200831041','2018','1학기','AA00010','비아메디아 채플-쟁점으로 만나는 그리스도교(비아 메디아)','1','P',NULL,243,'교필'),('200831041','2018','1학기','AD00158','대중서사의 이해','3','C+',NULL,244,'교선'),('200831041','2018','1학기','IC00033','졸업지도','1','P',NULL,245,'전필'),('200831041','2018','1학기','IC00009','데이터통신','3','A0',NULL,246,'전선'),('200831041','2018','1학기','IC00014','소프트웨어 캡스톤디자인','6','A+',NULL,247,'전선'),('1111111111111','2016','1학기','AC00001','경배와 찬양','0','P',NULL,248,'교필'),('1111111111111','2016','1학기','AC00012','대학생활세미나 I','2','P',NULL,249,'교필'),('1111111111111','2016','1학기','AD00016','영어명문산책 I','3','B0',NULL,250,'교선'),('1111111111111','2016','1학기','AF00031','애니메이션과게임으로세상읽기','3','C+',NULL,251,'교선'),('1111111111111','2016','1학기','ID00001','C프로그래밍Ⅰ','3','B0',NULL,252,'전필'),('1111111111111','2016','1학기','ID00004','정보통신개론','3','B0',NULL,253,'전선'),('1111111111111','2016','2학기','AC00001','시네마채플','0','P',NULL,254,'교필'),('1111111111111','2016','2학기','AC00013','말과글','2','B+',NULL,255,'교필'),('1111111111111','2016','2학기','AC00014','대학생활세미나 II','1','P',NULL,256,'교필'),('1111111111111','2016','2학기','AF00015','과학과 종교','3','B0',NULL,257,'교선'),('1111111111111','2016','2학기','AF00023','공업수학','3','C0',NULL,258,'교선'),('1111111111111','2016','2학기','GG00045','공연기획 및 제작','3','D+',NULL,259,'교선'),('1111111111111','2016','2학기','ID00023','C프로그래밍Ⅱ','3','A0',NULL,260,'전필'),('1111111111111','2016','2학기','ID00006','웹페이지 구축','3','B0',NULL,261,'전선'),('1111111111111','2016','2학기','ID00027','컴퓨터구조','3','B+',NULL,262,'전선'),('1111111111111','2017','1학기','AC00001','경배와 찬양','0','P',NULL,263,'교필'),('1111111111111','2017','1학기','AC00004','기초영어I','3','C+',NULL,264,'교선'),('1111111111111','2017','1학기','AC00007','인권과평화','3','P',NULL,265,'교선'),('1111111111111','2017','1학기','AD00029','연극과 공연예술','3','C+',NULL,266,'교선'),('1111111111111','2017','1학기','AF00024','확률','3','A0',NULL,267,'교선'),('1111111111111','2017','1학기','ID00005','논리회로설계 [R]','3','B+',NULL,268,'전필'),('1111111111111','2017','1학기','ID00007','전공지도I','1','P',NULL,269,'전필'),('1111111111111','2017','1학기','ID00008','자료구조','3','B0',NULL,270,'전필'),('1111111111111','2017','2학기','AC00001','경배와 찬양','0','P',NULL,271,'교필'),('1111111111111','2017','2학기','ID00029','데이터통신','3','C0',NULL,272,'전필'),('1111111111111','2017','2학기','ID00030','전공지도II','1','P',NULL,273,'전필'),('1111111111111','2017','2학기','ID00031','객체지향시스템','3','A+',NULL,274,'전필'),('1111111111111','2017','2학기','ID00028','통신이론','3','B+',NULL,275,'전선'),('1111111111111','2017','2학기','ID00032','리눅스 시스템','3','B0',NULL,276,'전선'),('1111111111111','2017','2학기','HB00019','문화컨텐츠 입문','3','B+',NULL,277,'복필'),('1111111111111','2018','1학기','AC00003','사회봉사I','2','P',NULL,278,'교필'),('1111111111111','2018','1학기','ID00009','운영체제','3','D0',NULL,279,'전필'),('1111111111111','2018','1학기','HB00002','디지털기초디자인','3','B+',NULL,280,'복필'),('1111111111111','2018','1학기','HB00018','문화컨텐츠 유통과 마케팅','3','B0',NULL,281,'복필'),('1111111111111','2018','1학기','HB00029','3D모델링','3','A0',NULL,282,'복필'),('1111111111111','2018','1학기','HB00046','스토리보드 제작','3','C+',NULL,283,'복선'),('1111111111111','2018','1학기','HB00085','3D기초&3D프린터 활용','1','P',NULL,284,'복선'),('20134052','2013','1학기','AC00001','채플(감사성찬례1)','0','P',NULL,285,'교필'),('20134052','2013','1학기','AC00011','인문학의 세계-느티아래 강좌','3','P',NULL,286,'교필'),('20134052','2013','1학기','AD00003','교양일본어 1','3','B0',NULL,287,'교선'),('20134052','2013','1학기','AE00016','영상과 문화로 보는 러시아','3','B+',NULL,288,'교선'),('20134052','2013','1학기','AE00022','정보사회론','3','B+',NULL,289,'교선'),('20134052','2013','1학기','AF00011','이산수학','3','A+',NULL,290,'교선'),('20134052','2013','1학기','IC00001','C프로그래밍Ⅰ','3','A+',NULL,291,'전필'),('20134052','2013','1학기','IC00016','과정지도 I','1','P',NULL,292,'전필'),('20134052','2013','2학기','AC00001','채플(종교 간 대화의 영성)','0','P',NULL,293,'교필'),('20134052','2013','2학기','AD00004','교양일본어 2','3','B+',NULL,294,'교선'),('20134052','2013','2학기','AD00039','서양문학의 흐름','3','C0',NULL,295,'교선'),('20134052','2013','2학기','AD00049','한국현대사','3','B+',NULL,296,'교선'),('20134052','2013','2학기','AF00001','컴퓨터활용','3','A+',NULL,297,'교선'),('20134052','2013','2학기','AF00002','대학수학','3','A+',NULL,298,'교선'),('20134052','2013','2학기','IC00019','C프로그래밍Ⅱ','3','A+',NULL,299,'전필'),('20134052','2013','2학기','IC00034','과정지도2','1','P',NULL,300,'전필'),('20134052','2014','1학기','AC00001','채플(시네마채플)','0','P',NULL,301,'교필'),('20134052','2014','1학기','AD00022','역사속의 한국과 미국','3','B+',NULL,302,'교선'),('20134052','2014','1학기','AE00012','아시아사회와 문화','3','D+',NULL,303,'교선'),('20134052','2014','1학기','AE00028','대중음악의이해','3','A+',NULL,304,'교선'),('20134052','2014','1학기','IC00002','컴퓨터구조','3','A+',NULL,305,'전필'),('20134052','2014','1학기','IC00003','데이타베이스개론','3','A+',NULL,306,'전필'),('20134052','2014','1학기','IC00007','자바프로그래밍','3','A0',NULL,307,'전필'),('20134052','2014','1학기','IC00017','과정지도3','1','P',NULL,308,'전필'),('20134052','2016','2학기','AC00001','경배와 찬양','0','P',NULL,309,'교필'),('20134052','2016','2학기','AD00114','인터넷과 글쓰기','3','B+',NULL,310,'교선'),('20134052','2016','2학기','AF00022','IT직업의 세계','3','B+',NULL,311,'교선'),('20134052','2016','2학기','IC00005','운영체제론','3','A0',NULL,312,'전필'),('20134052','2016','2학기','IC00021','자료구조론','3','A+',NULL,313,'전필'),('20134052','2016','2학기','IC00039','과정지도4','1','P',NULL,314,'전필'),('20134052','2016','2학기','IC00028','데이터베이스실습','3','A+',NULL,315,'전선'),('20134052','2016','2학기','IC00058','고급 Java 프로그래밍','3','B+',NULL,316,'전선'),('20134052','2017','1학기','IC00010','알고리즘','3','A+',NULL,317,'전필'),('20134052','2017','1학기','IC00043','과정지도5','1','P',NULL,318,'전필'),('20134052','2017','1학기','IC00006','시스템분석 및 설계','3','A0',NULL,319,'전선'),('20134052','2017','1학기','IC00011','고급웹프로그래밍 I','3','A0',NULL,320,'전선'),('20134052','2017','1학기','IC00029','사물인터넷기초','3','A0',NULL,321,'전선'),('20134052','2017','1학기','IC00036','C++프로그래밍','3','A+',NULL,322,'전선'),('20134052','2017','1학기','IC00060','Python 프로그래밍','3','A+',NULL,323,'전선'),('20134052','2017','2학기','AC00003','사회봉사I','2','P',NULL,324,'교필'),('20134052','2017','2학기','IC00044','과정지도6','1','P',NULL,325,'전필'),('20134052','2017','2학기','IC00018','사물인터넷 캡스톤디자인','6','A+',NULL,326,'전선'),('20134052','2017','2학기','IC00030','데이터베이스 캡스톤디자인','6','A+',NULL,327,'전선'),('20134052','2017','2학기','IC00040','고급웹프로그래밍 II','3','A+',NULL,328,'전선'),('20134052','2017','2학기','IC00045','모바일 프로그래밍 I','3','A+',NULL,329,'전선'),('20134052','2018','1학기','AA00010','비아메디아 채플-쟁점으로 만나는 그리스도교(비아 메디아)','1','P',NULL,330,'교필'),('20134052','2018','1학기','AD00158','대중서사의 이해','3','C+',NULL,331,'교선'),('20134052','2018','1학기','IC00033','졸업지도','1','P',NULL,332,'전필'),('20134052','2018','1학기','IC00009','데이터통신','3','A0',NULL,333,'전선'),('20134052','2018','1학기','IC00014','소프트웨어 캡스톤디자인','6','A+',NULL,334,'전선');
/*!40000 ALTER TABLE `mysubject` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `uploadedfile`
--

DROP TABLE IF EXISTS `uploadedfile`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `uploadedfile` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fileName` varchar(200) NOT NULL,
  `fileSize` int(11) NOT NULL,
  `fileTime` datetime NOT NULL,
  `data` longblob NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `uploadedfile`
--

LOCK TABLES `uploadedfile` WRITE;
/*!40000 ALTER TABLE `uploadedfile` DISABLE KEYS */;
/*!40000 ALTER TABLE `uploadedfile` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `userId` varchar(200) NOT NULL,
  `password` char(64) NOT NULL,
  `userName` varchar(45) NOT NULL,
  `email` varchar(45) NOT NULL,
  `phone` varchar(45) NOT NULL,
  `departmentName` varchar(45) NOT NULL,
  `gender` varchar(45) NOT NULL,
  `grade` varchar(45) NOT NULL,
  PRIMARY KEY (`userId`),
  UNIQUE KEY `userId_UNIQUE` (`userId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('1111111111111','test1234','김루비','ruby@naver.com','01066667777','국어국문학과','여','3'),('200831041','test1234','함석진','sukwon71@naver.com','010-8834-1111','소프트웨어공학과','남','4'),('20134052','test1234','이수진','lee333@skhu.ac.kr','010-8834-1113','컴퓨터공학과','여','2');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-30 13:39:44
